from django.core.management.base import BaseCommand

from tracker.models import Breed, PetType

DOG_BREEDS = [
    "Алабай", "Акита-ину", "Американский бульдог", "Английский бульдог",
    "Басенджи", "Бигль", "Бладхаунд", "Боксер", "Бордер-колли",
    "Бультерьер", "Веймаранер", "Вельш-корги", "Далматин",
    "Доберман", "Золотистый ретривер", "Ирландский сеттер",
    "Йоркширский терьер", "Кавказская овчарка", "Кане-корсо",
    "Колли", "Лабрадор", "Маламут", "Мопс", "Немецкая овчарка",
    "Папильон", "Пекинес", "Питбуль", "Померанский шпиц",
    "Пудель", "Ротвейлер", "Самоед", "Сенбернар",
    "Сиба-ину", "Такса", "Французский бульдог",
    "Хаски", "Чау-чау", "Шарпей", "Ши-тцу"
]

CAT_BREEDS = [
    "Абиссинская", "Австралийский мист", "Азиатская",
    "Балинезийская", "Бенгальская", "Бомбейская",
    "Британская короткошерстная", "Бурманская",
    "Девон-рекс", "Донской сфинкс", "Египетская мау",
    "Канадский сфинкс", "Корниш-рекс", "Курильский бобтейл",
    "Мейн-кун", "Манчкин", "Невская маскарадная",
    "Норвежская лесная", "Ориентальная",
    "Персидская", "Русская голубая",
    "Саванна", "Сиамская", "Сибирская",
    "Скоттиш-фолд", "Тайская", "Тойгер",
    "Турецкая ангора", "Шартрез"
]


class Command(BaseCommand):
    help = "Заполняет таблицу Breed (~500 собак, ~300 кошек)"

    def handle(self, *args, **options):
        breeds_to_create = []

        # ===== DOGS =====
        for name in DOG_BREEDS:
            breeds_to_create.append(
                Breed(
                    name=name,
                    type=PetType.DOG
                )
            )

        # ===== CATS =====
        for name in CAT_BREEDS:
            breeds_to_create.append(
                Breed(
                    name=name,
                    type=PetType.CAT
                )
            )

        Breed.objects.bulk_create(breeds_to_create)
